Процедура ПриСозданииНаСервере(Форма) Экспорт       //{{}}
	//{{Доработка DTK-32
	
	//---Добавем поле Контакта---
	СписокФорм = Новый СписокЗначений();
	СписокФорм.Добавить("Документ.ЗаказПокупателя.Форма.ФормаДокумента");
	СписокФорм.Добавить("Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента");
	СписокФорм.Добавить("Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента");
    СписокФорм.Добавить("Документ.ОплатаОтПокупателя.Форма.ФормаДокумента");
	СписокФорм.Добавить("Документ.ОплатаПоставщику.Форма.ФормаДокумента");   
	
	ИмяФормыВСписке = СписокФорм.НайтиПоЗначению(Форма.ИмяФормы);
	
	Если Форма.ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" тогда 
		ПолеКонтакт=Форма.Элементы.Вставить("КнЛ_Контакт", Тип("ПолеФормы"), Форма, Форма.Элементы.Основание);     
		ПолеКонтакт.Заголовок="Контактное лицо (КнЛ)";
		ПолеКонтакт.ПутьКДанным="Объект.КнЛ_Контакт";
		ПолеКонтакт.Вид=ВидПоляФормы.ПолеВвода;
	КонецЕсли;	

	Если Форма.ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" тогда 
		ПолеКонтакт=Форма.Элементы.Вставить("КнЛ_Контакт", Тип("ПолеФормы"), Форма, Форма.Элементы.СуммаДокумента);    
		ПолеКонтакт.Заголовок="Контактное лицо (КнЛ)";
		ПолеКонтакт.ПутьКДанным="Объект.КнЛ_Контакт";
		ПолеКонтакт.Вид=ВидПоляФормы.ПолеВвода;
	КонецЕсли;	
	
	Если Форма.ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" или
		 Форма.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" тогда 
		 ПолеКонтакт=Форма.Элементы.Добавить("КнЛ_Контакт", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
       //ПолеКонтакт=Форма.Элементы.Вставить("КнЛ_Контакт", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво, Форма.Элементы.Договор);
		ПолеКонтакт.Заголовок="Контактное лицо (КнЛ)";
		ПолеКонтакт.ПутьКДанным="Объект.КнЛ_Контакт";
		ПолеКонтакт.Вид=ВидПоляФормы.ПолеВвода;
	КонецЕсли;	
	
	Если Форма.ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" тогда 
       	//---Добавем поле Контакта---
		ПолеКонтакт=Форма.Элементы.Добавить("КнЛ_Контакт", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
		ПолеКонтакт.Заголовок="Контактное лицо (КнЛ)";
		ПолеКонтакт.ПутьКДанным="Объект.КнЛ_Контакт";
		ПолеКонтакт.Вид=ВидПоляФормы.ПолеВвода;
		
		//---Добавем поле Скидки---
		Команда1=Форма.Команды.Добавить("КнЛ_КомандаПересчитатьТаблицу");
		Команда1.Заголовок="ПересчитатьТаблицу";
		Команда1.Действие="Команда_КнЛ_ПересчитатьТаблицу"; //саму процедуру для команды будем писать в самой форме
		
	  //ГруппаА= Форма.Элементы.Добавить("КнЛ_ГруппаФормы", тип("ГруппаФормы"), Форма);//добавляет в конец формы
		ГруппаА= Форма.Элементы.Вставить("КнЛ_ГруппаФормы", тип("ГруппаФормы"), Форма, Форма.Элементы.страницы);//вставляет меред итоговой суммой 
		ГруппаА.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаА.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;      
		
		ПолеСкидка=Форма.Элементы.Добавить("КнЛ_Скидка", Тип("ПолеФормы"), ГруппаА);
		ПолеСкидка.Вид=ВидПоляФормы.ПолеВвода;     
		ПолеСкидка.Заголовок="Согласованная скидка";
		ПолеСкидка.ПутьКДанным="Объект.КнЛ_Скидка"; 
		ПолеСкидка.УстановитьДействие("ПриИзменении", "КнЛ_СкидкаПриИзменении");
		
		КнопкаК = Форма.Элементы.Добавить("КнЛ_Кнопка", тип("КнопкаФормы"), ГруппаА); 
		КнопкаК.Заголовок="Пересчитать2 таблицу";
		КнопкаК.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		КнопкаК.ИмяКоманды = "КнЛ_КомандаПересчитатьТаблицу";

	КонецЕсли;
	//}}	
КонецПроцедуры